Repository: ABIX-Edukacja/shoebot
Catalog: po/*.po
Languages: fr

source: usage: %prog [options] inputfile.bot
fr: utilisation: %prog [options] inputfile.bot

source: run script and output to FILE (accepts .svg, .ps, .pdf and .png extensions)
fr: lancer le script et la sortie dans FICHIER (extensions .svg, .ps, .pdf et .png acceptées)

source: run script in a GTK window
fr: lancer le script dans une fenêtre GTK

source: run in fullscreen mode
fr: lancer en mode plein écran

source: run a socket server for external control (will run the script in windowed mode)
fr: lancer un socket server pour un contrôle externe (le script apparaitra en mode fenêtre)

source: show a variable tweaking window (will run the script in windowed mode)
fr: montrer une fenêtre pour contrôler les variables (le script apparaîtra en mode fenêtre)

source: set socketserver port to listen for connections (default is 7777)
fr: configurer le port du socket server pour sa connexion (port 7777 par défaut)

source: set number of iterations, multiple images will be produced (only in non-windowed mode)
fr: configurer le nombre d'itérations, de mulitples images seront produites (uniquement en mode non fenêtre)

source: Error:
fr: Erreur:

source: Please specify an input script! (check /usr/share/shoebot/examples/ for example scripts)
fr: merci d'indiquer le script en entrée! (vous pouvez trouver des exemples de script à /usr/share/shoebot/examples)

source: Too many arguments!
fr: Il y a trop d'arguments !

source: No output file specified, defaulting to output.png...
fr: Aucun fichier a été spécifié, par défaut cela sera ouput.png...

source: Invalid extension in output filename
fr: Extension invalide pour le fichier de sortie

source: start sequence...
fr: début de la séquence...

source: Windowed mode does not take an output file argument.
fr: le mode fenêtre n'accepte pas de fichier de sortie en argument.

source: Sorry, repeat option is not valid in Windowed mode, it will be ignored
fr: Désolée, l'option répétition n'est pas valide en mode fenêtre, cela sera simplement ignoré

source: Untitled
fr: Sans titre

source: Untitled #%d
fr: Sans titre #%d

source: %d strings found and marked in red
fr: %d chaînes trouvées et mis en rouge

source: Save File
fr: Enregistrer

source: Save changes to '%s'?
fr: Enregistrer les changements en '%s'?

source: /_File
fr: /_Fichier

source: /File/_New
fr: /Fichier/_Nouveau

source: /File/_Open
fr: /Fichier/_Ouvrir

source: /File/_Save
fr: /Fichier/_Enregistrer

source: /File/Save _As...
fr: /Fichier/Enregistrer _Sous...

source: /File/sep1
fr: /Fichier/sep1

source: /File/_Close
fr: /Fichier/_Fermer

source: /File/E_xit
fr: /Fichier/Q_uitter

source: /_Edit
fr: /_Modifier

source: /Edit/Undo
fr: /Modifier/Annuler

source: /Edit/Redo
fr: /Modifier/Refaire

source: /Edit/sep1
fr: /Modifier/sep1

source: /Edit/Find...
fr: /Modifier/Chercher

source: /_Settings
fr: /_Paramètres

source: /Settings/Wrap _Off
fr: /Paramètres/A la ligne désactivé

source: /Settings/Wrap _Words
fr: /Paramètres/A la ligne _verbeux

source: /Settings/Wrap Off
fr: /paramètres/A la ligne désactivé

source: /Settings/Wrap _Chars
fr: /Paramètres/A la ligne _caractères

source: /_Run
fr: /_Lancer

source: /Run/_Run script
fr: /Lancer/_Lancer script

source: /Run/sep1
fr: /Lancer/sep1

source: /Run/Run socket server
fr: /Lancer/Lancer le socket server

source: /Run/Show variables window
fr: /Lancer/Montrer l'interface des variables

source: /Run/Run fullscreen
fr: /lancer/Lancer en plein écran

source: /_Help
fr: /_Aide

source: /Help/_About
fr: /Aide/_Apropos

source: This is a console window, error messages and script output are shown here, you can clear the window selecting and deleting the content
fr: Ceci est une console qui montre l'output du programme et éventuellement les erreurs, vous pouvez nettoyer la fenêtre sélectionnée et supprimer le contenu

source: Searching for `%s'
fr: Cherche `%s'

source: Search
fr: Cherche

source: Forward
fr: Avant

source: Backward
fr: Arrière

source: Wrong initializer for Point object
fr: Mauvaise initialisation pour l'objet Point

source: Copy is not implemented on this Grob class.
fr: Copier n'est pas implémenté pour cet objet Grob.

source: Unknown argument(s) '%s'
fr: Argument inconnu '%s'

source: Don't know how to copy '%s'.
fr: Comment copier '%s'.

source: Don't know what to do with %s.
fr: Que faire avec %s.

source: Wrong data passed to BezierPath.append(): %s
fr: Données erronées transmises à BezierPath.append(): %s

source: Wrong initialiser for PathElement (got "%s")
fr: Initialisation eronnée pour PathElement (reçu "%s")

source: got Color() with value None!
fr: reçu Color() avec une valeur nulle !

source: sorry, this image mode is not implemented yet
fr: désolée, ce mode d'image n'est pas encore implementé

source: Transform: Don't know how to handle transform %s.
fr: Transform: Comment utiliser la transformation %s.

source: Transform: Can only append Transforms or Cairo matrices (got %s)
fr: Transform: Il est possible d'ajouter les transformations ou les matrices Cairo (reçu %s)

source: Invalid path data!
fr: données invalides !

source: Invalid path, must begin with moveto.
fr: chemin non valide, il est préférable de commencer avec moveto.

source: Invalid path, no initial command.
fr: chemin non valide, absence de commande initiale.

source: Invalid number of parameters
fr: Numéro de paramètres non correcte

source: Unexpected end of path
fr: Fin de chemin inattendu

source: setvars(): setvars needs a dict!
fr: setvars(): la commande a besoin d'un dictionnaire !

source: run() needs an input file name or code string (if none was specified when creating the Bot instance)
fr: run() a besoin d'un fichier ou d'une chaîne de code (pour le cas où rien n'a été spécifié à la création de l'instance Bot)

source: rectmode: invalid input
fr: rectmode: entrée invalide

source: arrow: available types for arrow() are NORMAL and FORTYFIVE
fr: arrow: les types supportés par arrow() sont NORMAL et FORTYFIVE

source: No current path. Use beginpath() first.
fr: Aucun chemin. Utiliser d'abord beginpath()

source: outputmode() isn't implemented yet
fr: outputmode() n'est pas implémenté

source: Only RGB and HSB colormodes are supported.
fr: Seul les modes de couleurs RGB et HSB sont supportés

source: fontoptions() isn't implemented yet
fr: fontoptions() n'est pas implémenté

source: Canvas.add() - wrong argument: expecting a Grob, received %s
fr: Canvas.add() - mauvais argument : Grob attendu, reçu %s

source: setsurface(): No target specified!
fr: setsurface(): Aucun but spécifié !

source: setsurface: Argument must be a file name, a Cairo surface or a Cairo context
fr: setsurface: l'argument doit avoir un nom de fichier, une surface Cairo ou un contexte Cairo

source: drawpath(): Expecting a ClippingPath, got %s
fr: drawpath(): Clipping Path attendu, reçu %s

source: PathElement(): error parsing path element command (got '%s')
fr: PathElement(): erreur lors de l'interprétation de la commande d'un élément analysé (reçu '%s')

source: Warning: Canvas object had no fill or stroke values
fr: Attention : l'objet n'a pas de valeur de remplissage ou de contour

source: drawpath(): Expecting a BezierPath, got %s
fr: drawpath(): BezierPath attendu, reçu %s

source: Saved snapshot to %s
fr: Sauvegarder l'image %s

source: drawpath(): Input is not a valid BezierPath object
fr: drawpath(): objet BezierPath n'est pas un objet valide

source: drawpath(): Path is not properly constructed (expecting a path element, got
fr: drawpath(): le chemin n'est pas correctement tracé (attendu un élément chemin, reçu

source: findpath() isn't implemented yet (sorry)
fr: findpath() n'est pas implémenté, désolé

source: transform() isn't implemented yet
fr: transform() n'est pas encore implementé, désolé

source: Scale parameters can't be 0. Ignoring
fr: Le paramètre de mise à l'échelle ne peut être nulle. Cela sera ignoré

source: lineheight() isn't implemented yet
fr: lineheight() n'est pas encore implementé, désolé

source: align() isn't implemented in Shoebot yet
fr: align() non implementato, scusate

source: finish(): '%s' is an invalid extension
fr: finish(): '%s' est une extension non valide

source: run() needs an input file name or code string (if none was specified when creating the Box instance)
fr: run() nécéssité d'un nom de fichier en entrée ou d'une chaîne de code (pour le cas où rien n'est spécifié au moment de la création d'une instance Box)

source: Listening on port %i...
fr: Ecouter au port %i...

source: Connected
fr: Connecté

source: Connection closed.
fr: Connection fermée.

source: _Save as
fr: _Enregistrer sous

source: Save as _SVG
fr: Enregistrer comme _SVG

source: Save as _PDF
fr: Enregistrer comme _PDF

source: Save as P_S
fr: Enregistrer comme P_S

source: Save as P_NG
fr: Enregistrer comme P_NG

source: _Go fullscreen
fr: _Mode plein écran

source: _Exit fullscreen
fr: _Quitter le plein écran

source: _Close Window
fr: _Fermer la fenêtre
